# PyGWalker05.py
import pandas as pd
import pygwalker as pyg

# 建立範例 DataFrame
data = {
    "火車站": ["基隆火車站", "台北火車站", "桃園站火車站", "臺中火車站" , "臺南火車站", "高雄火車站"],
    "LAT緯度": [25.1323018, 25.0479239, 24.993628, 24.147735, 22.999727, 22.627278],
    "LNG經度": [121.7394664, 121.517081, 121.300979, 120.673648, 120.227028, 120.301435],
    "乘客數(日均人次)": [50000, 90000, 10000, 30000, 40000, 60000],
    "載運量說明": ["載運量正常", "載運量超載", "載運量過少", "載運量正常" , "載運量正常", "載運量正常"],
}
df = pd.DataFrame(data)

# 啟動 PyGWalker 互動視覺化
walker = pyg.walk(df)
